## Day 45: Medical Data Analysis

For this challenge, you are going to preprocess and analyze 
the medical data of patients. The name of the file is 
medical_data, and it is in CSV format. 
1. Import the medical_data dataset and view the first 5 rows. 
Use the info() method to get insights in the data.

In [2]:
import pandas as pd

df = pd.read_csv("medical_data.csv")
df.head(5)

  First Name First Letter Last Name       Condition     Gender    BMI
0      John             J     Smith       Healthy    Female 27  27.35
1      Mary             M     Jones        Cancer    Female 39  24.29
2       Amy             A     Candy  Heart Disease     Male 51  28.72
3     David             D      Tuss       Diabetes   Female 73  24.66
4   Michael             M   Brookes         Asthma     Male 71  28.21

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   First Name    10 non-null     object
 1   First Letter  10 non-null     object
 2   Last Name     10 non-null     object
 3   Condition     10 non-null     object
 4   Gender        10 non-null     object
 5   BMI           10 non-null     float64
dtypes: float64(1), object(5)
memory usage: 612.0+ bytes

2. What are the IQR ranges of the "BMI" column?

In [5]:
df.quantile

lower_limit = df['BMI'].quantile(q = 0.25)
upper_limit = df['BMI'].quantile(q = 0.75)


print(f'THe IQR range is {lower_limit:.2f} to {upper_limit:.2f}')

THe IQR range is 23.71 to 27.66

3. You must have noticed that there are two columns with 
names. As part of feature engineering, you are required to 
create a copy of your DataFrame (question 1). Combine the 
"First Name" column and the "Last Name" column into one 
column called "Names."

In [14]:
df2 = df.copy()
df2["Names"] = df2["First Name"].str.cat(df2["Last Name"], sep='')
df2.head()

,First Name,First Letter,Last Name,Condition,Gender,BMI,Names
0,John,J,Smith,Healthy,Female 27,27.35,John Smith
1,Mary,M,Jones,Cancer,Female 39,24.29,Mary Jones
2,Amy,A,Candy,Heart Disease,Male 51,28.72,Amy Candy
3,David,D,Tuss,Diabetes,Female 73,24.66,David Tuss
4,Michael,M,Brookes,Asthma,Male 71,28.21,Michael Brookes

4. Now that you have combined the two columns, drop 
columns "First Name" and "Last Name" from the 
DataFrame and change the order of the columns to: 
[Names, First Letter, BMI, Gender, Condition].

In [15]:
# Drop the two columns
df2.drop(columns=(["First Name", "Last Name"]), axis=1, inplace=True)

# using iloc to change columns order
df2 = df2.iloc[:, [4, 0, 3, 2, 1]]
df2.head()

             Names First Letter    BMI     Gender       Condition
0       John Smith            J  27.35  Female 27       Healthy
1       Mary Jones            M  24.29  Female 39        Cancer
2        Amy Candy            A  28.72    Male 51  Heart Disease
3       David Tuss            D  24.66  Female 73       Diabetes
4  Michael Brookes            M  28.21    Male 71         Asthma

5. The "Gender" column is combined with the age. Your task 
is to create a new column for age by separating age from the 
"Gender" column. Once you do that, make the "Condition" 
column the last column of the DataFrame. Your columns' 
order must be: [Name, First Letter, BMI, Gender, Age, 
Condition].

In [16]:
# Creating two columns from the Gender column using the split method
df2[['Gender', 'Age']] = df2.Gender.str.split(" ", expand=True)

# using iloc to change columns order
df2 = df2.iloc[:, [0, 1, 2, 3, 5, 4]]
df2.tail()

          Names First Letter    BMI  Gender Age       Condition
5   Jessica kil            J  27.76    Male  61       Diabetes
6   Mike Storey            M  23.51  Female  28         Asthma
7    Sarah Mary            S  26.78    Male  39  Heart Disease
8  Chris Derick            C  21.50    Male  61        Healthy
9     Emily Cat            E  21.62    Male  61         Asthma